#include <sys/types.h>
#include <sys/stat.h>
#include <sys/ioctl.h>
#include <sys/mman.h>
#include <fcntl.h>
#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>

#include "header.h"

#define PIOA_ID 2
#define TC0_ID 17

#define BUT_IDLE 0
#define BUT_PRESSED 1
#define BUT_RELEASED 2

#define LED_IDLE 0
#define LED_FLASHING 1

void FIQ_handler(void);

PIO* pioa = NULL;
AIC* aic = NULL;
TC* tc = NULL;

unsigned int button_state = BUT_IDLE;
unsigned int led_state = LED_IDLE;

int main( int argc, const char* argv[] ){
	unsigned int gen;

	STARTUP; //ΑΡΧΙΚΟΠΟΙΗΣΗ ΣΥΣΤΗΜΑΤΟΣ
	tc->Channel_0.RC  = 8192; //ΠΕΡΙΟΔΟΣ 1 ΔΕΥΤΕΡΟΛΕΠΤΟ
	tc->Channel_0.CMR = 2084; // SLOW CLOCK , WAVEFORM , DISABLE CLK ON RC COMPARE
	tc->Channel_0.IDR = 0xFF; //ΑΠΕΝΕΡΓΟΠΟΙΗΣΗ ΟΛΩΝ ΤΩΝ ΔΙΑΚΟΠΩΝ
	tc->Channel_0.IER = 0x10; //ΕΝΕΡΓΟΠΟΙΗΣΗ ΜΟΝΟ ΤΟΥ RC COMPARE

	aic->FFER = (1<<PIOA_ID) | (1<<TC0_ID); //ΟΙ ΔΙΑΚΟΠΕΣ 2 ,17 ΕΙΝΑΙ ΤΥΠΟΥ FIQ
	aic->IECR = (1<<PIOA_ID) | (1<<TC0_ID); //ΕΝΕΡΓΟΠΟΙΗΣΗ ΔΙΑΚΟΠΩΝ : PIOA & TC0
	pioa->PUER = 0x01; //ΕΝΕΡΓΟΠΟΙΗΣΗ ΣΤΗ ΓΡΑΜΜΗ 0 : PULL−UP
	pioa->ODR  = 0x01; //ΓΡΑΜΜΗ 0 : ΛΕΙΤΟΥΡΓΙΑ ΕΙΣΟΔΟΥ
	pioa->CODR = 0x02; //ΓΡΑΜΜΗ 1 : ΔΥΝΑΜΙΚΟ ΕΞΟΔΟΥ LOW
	pioa->OER  = 0x02; //ΓΡΑΜΜΗ 1 : ΛΕΙΤΟΥΡΓΙΑ ΕΞΟΔΟΥ

	gen       = pioa->ISR; // PIOA : ΕΚΚΑΘΑΡΙΣΗ ΑΠΟ ΤΥΧΟΝ ΔΙΑΚΟΠΕΣ
	pioa->PER = 0x03; //ΓΡΑΜΜΕΣ 0 , 1 : ΓΕΝΙΚΟΥ ΣΚΟΠΟΥ
	gen       = tc->Channel_0.SR; //TC0 : ΕΚΚΑΘΑΡΙΣΗ ΑΠΟ ΤΥΧΟΝ ΔΙΑΚΟΠΕΣ
	aic->ICCR = (1<<PIOA_ID)|(1<<TC0_ID); // AIC : ΕΚΚΑΘΑΡΙΣΗ ΑΠΟ ΤΥΧΟΝ ΔΙΑΚΟΠΕΣ
	pioa->IER = 0x01; //ΕΝΕΡΓΟΠΟΙΗΣΗ ΔΙΑΚΟΠΩΝ ΣΤΗ ΓΡΑΜΜΗ 0


	/* ============ Κεντρικός ϐρόχος ============
	Εκτελείται μέχρι να πατηθεί το πλήκτρο 'e' + enter. Εδώ μπορεί να προστεθεί ο κώδικας επεξερ-
	γασίας των δεδομένων. Θεωρείται ως νήμα χαμηλής προτεραιότητας, διότι μπορεί να διακοπεί από
	τη ϱουτίνα εξυπηρέτησης διακοπών.
	   ==========================================*/
	unsigned int tmp;
	while( (tmp = getchar()) != 'e'){


	}

	/* ========= Τερματισμός συστήματος =========
	Επιστρέφει τις δεσμευμένες περιοχές στο σύστημα και απενεργοποιεί τις διακοπές.
	   ==========================================*/

	aic->IDCR = (1<<PIOA_ID) | (1<<TC0_ID); // ΔΙΑΚΟΠΗ ΤΩΝ AIC interrupts
	tc->Channel_0.CCR = 0x02; // ΑΠΕΝΕΡΓΟΠΟΙΗΣΗ ΤΟΥ Timer
	CLEANUP;
	return 0;
}

/* ============ ΄Ελεγχος διακόπτη ===========
4. ΄Ελεγχος μονάδας εισόδου/εξόδου. Εξετάζει αν η μονάδα εισόδου/εξόδου προκάλεσε τη
διακοπή, ή περιμένει να εξυπηρετηθεί.
5. ΄Ελεγχος κατάστασης διακόπτη. Εξετάζει αν ο διακόπτης πατήθηκε ή αφέθηκε.
6. ΄Ελεγχος σημειωμένης κατάστασης διακόπτη. Ελέγχει αν η κατάσταση στην οποία είχε
σημειωθεί πως ϐρισκόταν ο διακόπτης, πριν αρχίσει να εξυπηρετείται η διακοπή, είναι η ¨ΜΗ
ΠΑΤΗΜΕΝΟΣ¨.
7. Αλλαγή τρέχουσας κατάστασης. Σημειώνει πως η κατάσταση του διακόπτη είναι ¨ΠΑΤΗ-
ΜΕΝΟΣ¨.
8. ΄Ελεγχος κατάστασης LED Ελέγχει αν το LED έχει σημειωθεί πως είναι σε κατάσταση ¨ΔΕΝ
ΑΝΑΒΟΣΒΗΝΕΙ¨.
9. Ενεργοποίηση Μετρητή Ξεκινά τη μέτρηση του 1 δευτερολέπτου και σημειώνει πως η κατάσ-
ταση του LED είναι ¨ΑΝΑΒΟΣΒΗΝΕΙ¨.
	==========================================*/

void FIQ_handler(void)
{
	unsigned int data_in = 0;
	unsigned int fiq = 0;
	unsigned int data_out;

	fiq = aic->IPR; //ΕΝΤΟΠΙΣΜΟΣ ΠΕΡΙΦΕΡΕΙΑΚΟΥ ΠΟΥ ΠΡΟΚΑΛΕΣΕ ΤΗ ΔΙΑΚΟΠΗ
	
	if( fiq & (1<<PIOA_ID) ) //ΕΛΕΓΧΟΣ ΓΙΑ PIOA
	{
		data_in = pioa->ISR; //ΕΚΚΑΘΑΡΙΣΗ ΤΗΣ ΠΗΓΗΣ ΤΗΣ ΔΙΑΚΟΠΗΣ
		aic->ICCR = (1<<PIOA_ID); //ΕΚΚΑΘΑΡΙΣΗ ΤΗΣ ΔΙΑΚΟΠΗΣ ΑΠΟ AIC
		data_in = pioa->PDSR; //ΑΝΑΓΝΩΣΗ ΤΙΜΩΝ ΕΙΣΟΔΟΥ
		if( data_in & 0x01 ) //ΔΙΑΚΟΠΤΗΣ ΠΑΤΗΜΕΝΟΣ;
		{
			if(button_state == BUT_IDLE)
			{
				button_state = BUT_PRESSED;
				if( led_state == LED_IDLE ) //ΑΝ ΔΕΝ ΑΝΑΒΟΣΒΗΝΕΙ
				{
					tc->Channel_0.CCR = 0x05; //ΕΝΑΡΞΗ ΜΕΤΡΗΤΗ
					led_state = LED_FLASHING;

				/* ============ ΄Ελεγχος διακόπτη ============
				10. Απενεργοποίηση Μετρητή. Απενεργοποιεί τον μετρητή και σημειώνει πως το LED είναι σε
				κατάσταση ¨ΔΕΝ ΑΝΑΒΟΣΒΗΝΕΙ¨.
				11. ΄Ελεγχος σημειωμένης κατάστασης διακόπτη. Ελέγχει αν η κατάσταση στην οποία είχε
				σημειωθεί πως ϐρισκόταν ο διακόπτης, πριν αρχίσει να εξυπηρετείται η διακοπή, είναι η ¨ΠΑΤΗ-
				ΜΕΝΟΣ¨.
				12. Αλλαγή τρέχουσας κατάστασης. Σημειώνει πως η κατάσταση του διακόπτη είναι ¨ΜΗ
				ΠΑΤΗΜΕΝΟΣ¨.
				   ==========================================*/
					
				}else{
					tc->Channel_0.CCR = 0x02; //ΔΙΑΚΟΠΗ ΜΕΤΡΗΤΗ
					led_state = LED_IDLE;
				}
			}
		}else{
			if(button_state == BUT_PRESSED) button_state = BUT_IDLE;
		}
	}
	
	if( fiq & (1<<TC0_ID) )
	{
		data_out = tc->Channel_0.SR;//ΕΚΚΑΘΑΡΙΣΗ ΤΗΣ ΠΗΓΗΣ ΤΗΣ ΔΙΑΚΟΠΗΣ
		aic->ICCR = (1<<TC0_ID); //ΕΚΚΑΘΑΡΙΣΗ ΔΙΑΚΟΠΗΣ ΚΑΙ ΑΠΟ AIC
		data_out = pioa->ODSR; //ΑΝΑΓΝΩΣΗ ΤΙΜΩΝ ΕΞΟΔΟΥ
		pioa->SODR = data_out & 0x02;
		pioa->CODR = data_out & 0x02;
		tc->Channel_0.CCR = 0x05;
	}
}
